COMMANDS_RU = {
    '/help' : 'Рассказать Вам о том, о чем я Вам щас рассказываю :)',
    '/buy' : 'Перейти к выбору категории товара',
    '/cart' : 'Посмотреть содержимое своей корзины',
    '/clear_cart' : 'Очистить содержимое своей корзины'
}

LEXICON_RU = {
    '/start' : 'Привет! Меня зовут ЛайфМастер-бот \n\n\
Я помогу выбрать Вам нужный товар и отправлю его в Ваш город!\n\n\
Какие товары Вас интересуют?',

    '/help' : f'Привет! Я - ЛайфМастер-бот\n\n\
Я здесь для того, чтобы ты мог купить нужный тебе товар онлайн\n\nВот какие команды я распознаю:\n',

    'no_echo' : 'Кажется, я Вас не понял :(\nЯ не могу обработать сообщения такого типа)',

    'vehicles_pt1' : 'Отлично! Вот список имеющихся у нас на складе автомобилей:\n\n',

    'vehicles_pt2' : 'Какой тебя интересует?',

    'details_pt1' : 'Отлично! Вот список имеющихся у нас на складе деталей:\n\n',

    'details_pt2' : 'Какая тебя интересует?',

    'add_to_cart' : 'Добавить в корзину товар: ',

    'added_to_cart' : 'Товар успешно добавлен в корзину!\n\nХотите посмотреть что-то еще?',

    'not_added_to_cart' : 'Очень жаль :(\n\nХотите посмотреть что-то еще?',

    'agree' : 'Что Вас интересует?',

    'deny' : 'Понял вас\n\nЕсли захотите что-то посмотреть, напишите /buy',

    'happy' : 'Я надеялся, что вы захотите посмотреть наш ассортимент :)\n\nЧто Вас интересует?',

    'undefined_message' : 'Кажется, я вас не понял :(\n\nЧтобы узнать как взаимодействовать со мной, напишите /help',

    'to_much_positions' : 'Думаю, в вашей корзине нет столько позиций :(',

    'undefined_position' : 'Кажется, я не смог понять, какая позиция вам нужна :(',

    'position_cleaned_with_continue' : 'Позиция успешно удалена!\n\nЖелаете удалить из корзины что-то еще?',

    'position_cleaned_without_continue' : 'Позиция успешно удалена!\n\nТеперь Ваша корзина пуста!',

    'gotcha' : 'Понял вас!',

    'specify_part1' : f'Вы хотите удалить из корзины ',

    'specify_part2' : f', верно?',

    'lets_fill_cart' : 'Ваша корзина пуста\n\nЗаполним её? :)',

    'cant_clear' : 'Вам нечего удалять, корзина пуста\n\n',

    'select_position_to_clear' : 'Какой товар Вы желаете удалить?\n',

    '/cancel' : 'Перевожу Вас в главное меню',

    'your_cart' : 'Вы набрали такую корзину:\n\n',

    'final_price_pt1' : 'Общая цена - ',

    'wallet' : ' Р',

    'model' : 'Модель: ',

    'count_on_stock' : 'Количество на складе: ',

    'price' : 'Цена: ',

    'yes' : 'да',

    'no' : 'нет',

    'add' : 'добавить',

    'details' : 'детали',

    'vehicles' : 'машины',

    'already_in_menu' : 'Нечего отменять\n\nВы уже в главном меню',

    'bot_already_works' : 'Я уже готов к работе, данная команда не принесет результата\n\n\
Если Вы не знаете, что делать, напишите команду /help'

}